// const value = prompt("Enter something");
// console.log(value);
// alert("Hello");
// const value = confirm("Hello");
// console.log(value);

//!     Завдання 1:
//?     Запропонуйте користувачу ввести число за допомогою prompt().
//?     Збережіть введене значення у змінну number.
//?     Перевірте, чи дорівнює змінна number числу 10:
//?        Якщо так – виведіть повідомлення 'Вірно' у alert().
//?        Якщо ні – виведіть 'Невірно'.
//?     Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
//?     перетворіть значення на число за допомогою Number().

//* const number = Number(prompt("Введіть число"));
//* const number = +prompt("Введіть число");
//* const number = prompt("Введіть число") * 1;

//* if (number === 10) {
//*   alert("Вірно");
//* } else {
//*   alert("Невірно");
//* }
//* alert(number === 10 ? "Вірно" : "Не вірно");

//!_______________________________________________________________________

//!      Завдання 2:
//?      У змінній min лежить випадкове число від 0 до 59.
//?      Визначте, в яку чверть години потрапляє
//?      це число (у першу, другу, третю чи четверту).
//?      Виведіть в alert відповідне повідомлення, наприклад:
//?      "10 входить в першу чверть"
//?      const min = Math.floor(Math.random() * (59 - 0) + 0);

const min = Math.floor(Math.random() * (59 - 0) + 0);
if (min >= 0 && min <= 15) {
  alert(`${min} входить в першу чверть`);
} else if (min >= 16 && min <= 30) {
  alert(`${min} входить в другу чверть`);
} else if (min >= 31 && min <= 45) {
  alert(`${min} входить в третю чверть`);
} else if (min >= 46 && min <= 59) {
  alert(`${min} входить в четверту чверть`);
}

//!_______________________________________________________________________
